use nuchiie::ToChinese;

#[test]
fn test() {
    for (num, chinese) in [
        (0u128, "零"),
        (1, "一"),
        (7, "七"),
        (10, "十"),
        (13, "十三"),
        (39, "三十九"),
        (211, "二百一十一"),
        (502, "五百零二"),
        (100000, "十万"),
        (101000, "十万一千"),
        (10000005, "一千万零五"),
        (500500500, "五亿零五十万零五百"),
        (700000010, "七亿零一十"),
        (1234567890, "十二亿三千四百五十六万七千八百九十"),
        (10000000030, "一百亿零三十"),
        (575156413357, "五千七百五十一亿五千六百四十一万三千三百五十七"),
        (111111111111111, "一百一十一万亿一千一百一十一亿一千一百一十一万一千一百一十一"),
        (100000000000000000000001, "一千万亿亿零一"),
        (1000000000000000000000000, "一亿亿亿"),
        (10000000000000000000100000, "十亿亿亿零一十万"),
        (8700000840600000008890909800, "八千七百亿亿亿八万亿亿四千零六十亿亿零八十八亿九千零九十万九千八百"),
        (u128::MAX, "三百四十万亿亿亿亿二千八百二十三亿亿亿亿六千六百九十二万亿亿亿零九百三十八亿亿亿四千六百三十四万亿亿六千三百三十七亿亿四千六百零七万亿四千三百一十七亿六千八百二十一万一千四百五十五")
    ] {
        assert_eq!(num.to_chinese(), chinese.to_string());
    }
}