use nuchiie::ToChinese;

#[test]
fn test() {
    for (num, chinese) in [
        (0u128, "零"),
        (1, "一"),
        (7, "七"),
        (10, "十"),
        (13, "十三"),
        (39, "三十九"),
        (211, "二百一十一"),
        (502, "五百零二"),
        (100000, "十万"),
        (101000, "十万一千"),
        (10000005, "一千万零五"),
        (500500500, "五亿零五十万零五百"),
        (700000010, "七亿零一十"),
        (1234567890, "十二亿三千四百五十六万七千八百九十"),
        (10000000030, "一百亿零三十"),
        (575156413357, "五千七百五十一亿五千六百四十一万三千三百五十七"),
        (111111111111111, "一百一十一兆一千一百一十一亿一千一百一十一万一千一百一十一"),
        (100000000000000000000001, "一千垓零一"),
        (1000000000000000000000000, "一秭"),
        (10000000000000000000100000, "十秭零一十万"),
        (8700000840600000008890909800, "八千七百秭八垓四千零六十京零八十八亿九千零九十万九千八百"),
        (u128::MAX, "三百四十涧二千八百二十三沟六千六百九十二穰零九百三十八秭四千六百三十四垓六千三百三十七京四千六百零七兆四千三百一十七亿六千八百二十一万一千四百五十五")
    ] {
        assert_eq!(num.to_chinese(), chinese.to_string());
    }
}
